`timescale 1ns / 1ps

// ----------------------------------------------------------------
// 模块名称：and_gate (与门)
// 硬件本质：在物理芯片内部，它会变成一个 2输入查找表 (2-input LUT)。
// 你可以把它想象成一个密码锁，只有两个钥匙孔同时插对，锁才会开。
// ----------------------------------------------------------------
module and_gate (
    input  wire a, // 物理引脚 A，wire 代表这是一根真实的铜导线
    input  wire b, // 物理引脚 B
    output wire y  // 物理引脚 Y，负责把结果输出去
);

    // 连续赋值语句 (Combinational Logic)
    // 硬件思维：这绝不是软件里计算 a&b 的值，而是用电焊把 a、b 和 y 连起来，
    // 形成一个实时联动的电路。a 和 b 只要一变，y 瞬间就会跟着变！
    assign y = a & b;



endmodule


